// -----------------------------------------------------------------------------------------
	// Задание 8
// -----------------------------------------------------------------------------------------

/*
8. За допомогою циклу while / do-while реалізувати timer на 10 секунд. Зверніть увагу на властивості обєкту/Конструктора Date (не використовуючи JS timer - setTimeOut)
*/

var start = Date.now();
var interval = 1000;
var timer = 10;
var i = 1;

while (i <= timer) {

	if(Date.now() - start === interval) {
		console.log(i++ + ' sec');
		start += interval;
	}

}